"""
Starred expression - синтаксис * или **, который распаковывает последовательности и собирает остаток в переменную.
* - последовательности (list, tuple, set, generator)
** - mapping (dict, объекты с .keys())
"""

# Примеры с разным расположением:
*a, b, c = [1, 2, 3, 4, 5]
print(a, b, c) # [1, 2, 3] 4 5

a, *b, c = [1, 2, 3, 4, 5]
print(a, b, c) # 1 [2, 3, 4] 5

a, b, *c = [1, 2, 3, 4, 5]
print(a, b, c) # 1 2 [3, 4, 5]

# Объединение словарей при помощи Starred expression:
d1 = {"x": 1}
d2 = {"y": 2}
d = {**d1, **d2}
print(d) # {"x": 1, "y": 2}

# Оператор * перед list(zip(x, y)) распаковывает список кортежей, превращая его в отдельные аргументы для print().
x = 'hello'
y = 'world'
print(*list(zip(x, y)), sep='\n')